<!DOCTYPE html>
<html>
	<head>
		<meta charset="ISO-8859-1">
		<title>Zuse, Konrad</title>
	</head>
	<body>
		<h1 >Zuse, Konrad (German, 1910-1995)</h1> 
		<h2 >von Prof. Dr. Ra&uacute;l Rojas</h2>
		
		<div>
			<p>Konrad Zuse wird im Volksmund in Deutschland als Erfinder der Computer nicht erkannt. Er baute eine mechanische Vorrichtung, die er als Z1, im Wohnzimmer der Wohnung seiner Eltern in Berlin. Der Bau der Z1, die erste programmierbare bin&auml;re Rechenmaschine der Welt, begann 1936 und endete im Jahr 1938.</p>
			<p>Nach der High School begann Zuse sein Studium an der Technischen Hochschule Berlin-Charlottenburg. Als ein sehr guter Maler, war sein erster Impuls, um Architektur zu studieren. Aber er war auch ein T&uuml;ftler und ein erfinderischer Modellbauer, der f&auml;hig ist auszuhecken erstaunliche Maschinen, nur um seine Mitsch&uuml;ler zu beeindrucken. Er lie&szlig; sich schlie&szlig;lich f&uuml;r den Tiefbau und verdiente sich sein Studium im Jahr 1935.</p>
			<p>W&auml;hrend seines Studiums lernte Zuse, wie man die sich wiederholenden statischen Berechnungen notwendig, um Strukturen wie Br&uuml;cken, oder unverzichtbare bauen, um den Stress auf der Maschine bestimmen, Materialien durchzuf&uuml;hren. Von seiner eigenen Darstellung war dies der Zeitraum, in dem er begann unter Ber&uuml;cksichtigung der M&ouml;glichkeit der Automatisierung dieser Aufgabe. Statische Berechnungen wurden durch das Ausf&uuml;llen von Formularen, in denen alle notwendigen Formeln worden war vorgedruckt durchgef&uuml;hrt. Der Ingenieur musste lediglich in seinen Daten zu f&uuml;llen, und folgen Sie den vorgeschriebenen rechnerischen Weg - sicherlich eine Maschine k&ouml;nnte diese Arbeit zu tun.</p>
			<p>Nach dem Studium begann Zuse arbeitet f&uuml;r die Henschel Flugzeug-Werke in Berlin. Er war verantwortlich f&uuml;r die Durchf&uuml;hrung von statischen Berechnungen. Jedoch trat er ein paar Monate, nachdem sie eingestellt worden, und beschloss, in ein Erfinder zu machen. Zuse war ein Unternehmer und seine erste Kreation war es, eine Rechenmaschine zu sein. Mit seiner Eltern Hilfe, fing er an den Automaten, die bis dahin nur in seiner Phantasie existiert hatte bauen. Einige Freunde, indem sie f&uuml;r ihn unterst&uuml;tzt, andere gaben ihm kleine Mengen an Geld, so dass er die Z1 beenden konnte. Dies ist vielleicht der wichtigste Unterschied zwischen Zuse und andere Computer-Erfinder arbeitet an der Zeit zu sein: w&auml;hrend in den USA Atanasoff hatte Aiken, Mauchly und Eckert die Ressourcen von Universit&auml;ten oder Unternehmen zur Verf&uuml;gung, Konrad Zuse war alleine arbeiten. Die ganze logische und mechanische Konstruktion der Maschine war seine einzige und eigene Arbeit.</p>
			<p>Die Z1 war im Jahr 1938 in Betrieb genommen. Zuse, unwissend &uuml;ber die interne Struktur von jeder Art von Rechner zu der Zeit gebaut, angefangen von Grund auf und entwickelte eine ganz neue Art der mechanischen Konstruktion. W&auml;hrend zeitgen&ouml;ssische Tischrechner im Dezimalsystem beruhte und arbeitete mit rotierenden mechanischen Komponenten, beschloss Zuse, um die bin&auml;re System-und Metallplatten, die nur bewegen k&ouml;nnte in eine Richtung, die sie nur zu verlagern Position ist zu verwenden. Diese Platten waren alle, was f&uuml;r eine bin&auml;re Maschine ben&ouml;tigt wurde, aber einige andere Hindernisse mussten &uuml;berwunden werden. Es war nicht nur notwendig, um die vollst&auml;ndige logische Beschreibung der Maschine zu entwerfen und dann entsprechend zu verdrahten - die mechanischen Komponenten stellte eine weitere gro&szlig;e Herausforderung, da jede Bewegung von einem logischen Gatter musste mit der Bewegung der anderen Gatter gekoppelt werden. Lineare Verschiebungen der Komponenten haben, um lineare Verschiebungen in verschiedenen Schichten der Maschine, oder Ver&auml;nderungen in der senkrechten Richtungen umgewandelt werden. Es ist sicher zu sagen, dass aus heutiger Sicht, die mechanische Konstruktion der Maschine wesentlich anspruchsvoller als die logische Struktur war. Niemand, au&szlig;er Zuse, genau verstanden, wie die Maschine funktionierte, obwohl viele seiner Freunde halfen beim Schneiden die Hunderte von Metallplatten f&uuml;r das Ger&auml;t erforderlich. Wenn Sie fertig sind, wurde die Maschine gezeigt, die Berechnung der Determinante einer 3 × 3-Matrix an mehrere Personen.</p>
			<p>Die Zeit war f&uuml;r ein ehrgeiziges Projekt zu kommen. Die mechanische Z1 hatte bewiesen, dass die logische Struktur der Maschine Sound und jetzt eine elektronische oder elektrische Realisierung mit Relais, k&ouml;nnte in Erw&auml;gung gezogen werden sollte. Helmut Schreyer, ein Elektroniker und ein Freund von Zuse, schlug den Einsatz von Vakuum-R&ouml;hren. Schreyer, in der Tat erlie&szlig; das als Ph.D. Projekt und entwickelte einige R&ouml;hrenschaltungen f&uuml;r die elektronische Maschine. Zuse selbst war nicht wirklich sicher, dass Vakuum-R&ouml;hren verwendet werden sollten. Sie versprachen, extrem schnelle Berechnungen, aber er dachte, dass Vakuumr&ouml;hre Maschinen konnte nicht gemacht, um so zuverl&auml;ssig wie Relais oder auch mechanische Komponenten durchf&uuml;hren werden. Zuse war bereits der Betrachtung der Einsatzm&ouml;glichkeiten f&uuml;r seine Maschine und wurde projizierte seine Implementierung in gro&szlig;en oder mittelst&auml;ndischen Unternehmen. Sein Ziel war die Entwicklung eines programmierbaren Ersatz f&uuml;r mechanische Tischrechner. Die Maschinen sollten belastbar und fehlertolerant.</p>
			<p>Dennoch zeigte Schreyer und Zuse einige der elektronischen Schaltungen auf eine kleine Gruppe an der Universit&auml;t im Jahre 1938. Sie wurden gefragt, wie viele R&ouml;hren f&uuml;r eine Rechenmaschine ben&ouml;tigt w&uuml;rde. Als sie sagte, dass 2000 mehrere tausend Rohre und andere Komponenten n&ouml;tig w&auml;re, das Publikum einfach links ungl&auml;ubig an. Die komplexesten Vakuumkreise zu dem Zeitpunkt nicht mehr verwendet werden, dass einige hundert R&ouml;hren. Die Leistung muss die Maschine arbeiten zu halten sei &uuml;bertrieben. Ein paar Jahre sp&auml;ter, w&uuml;rde der ENIAC zur Welt zu zeigen, dass Vakuumr&ouml;hre Maschinen waren in der Tat teuer zu bauen, aber machbar.</p>
			<p>Der Beginn des Zweiten Weltkriegs hatte unmittelbare Folgen f&uuml;r die Zuse. Er wurde berufen, in der Armee dienen, wo er sechs Monate blieb. Mit Hilfe von Kurt Pannke, ein Konstrukteur von mechanischen Rechenmaschinen, versuchte Zuse, um einen Transfer nach Berlin zu erhalten, um seine Arbeit an der n&auml;chsten Rechenmaschine auf Basis von telefonischen Relais fortzusetzen. Helmut Schreyer, der als Ingenieur an der Universit&auml;t arbeitete, versuchte auch Zuses Entladung zu erhalten. Er bot den milit&auml;rischen Befehl, um eine automatische Luftverteidigung Maschine einsatzbereit sein k&ouml;nnte in zwei Jahren zu bauen. Die Antwort war ein h&auml;misches Erinnerung an ihn, dass der Krieg in viel k&uuml;rzerer Zeit gewonnen werden w&uuml;rde. Schlie&szlig;lich k&ouml;nnte Zuse arrangieren, um zum Henschel Flugzeug Fabrik, wo er war, um die Berechnungen f&uuml;r die Stabilit&auml;t der fliegenden Bomben (heute Cruise Missiles), die in Berlin gebaut wurden ben&ouml;tigt machen &uuml;bertragen werden.</p>
			<p>Zuse begann f&uuml;r den speziellen Bereich F bei den Henschel-Stoff im Jahre 1940. W&auml;hrend dieser Zeit hat er zwei Maschinen, die automatisch messen konnten einige Parameter der Rakete Fl&uuml;gel entwickelt, verwandle die analoge Messung in eine digitale Zahl, und berechnen Sie eine Formel in diesen Werten basiert. Dies k&ouml;nnte auch der erste Analog-Digital-Wandler f&uuml;r die nachfolgende digitale Berechnungen gebaut. Im Jahr 1940 baute er auch die Maschine Z2, der einen Integer-Prozessor von Relais und einem mechanischen Speicher gebaut werden. Die Maschine wurde an mehrere Personen gezeigt und Zuse konnte den deutschen Luftraum Research Office (DLV in deutscher Sprache) zu &uuml;berzeugen, zur teilweisen Finanzierung der Entwicklung der Rechenmaschine Z3, die nur mit Relais gebaut werden w&uuml;rde. Die Z3 war 1941 in Betrieb - es hatte die gleiche logische Aufbau der Z1, aber benutzt elektrischen Komponenten.</p>
			<p>Zuse arbeitete weiter f&uuml;r den Henschel-Werken, sondern startete sein eigenes Gesch&auml;ft im Jahr 1941. Die Zuse Ingenieurb&uuml;ro und Apparatebau, Berlin war das erste Unternehmen mit dem alleinigen Zweck der Entwicklung von Computern gegr&uuml;ndet. Der Erfolg mit dem Z3 gebracht Zuse einen Vertrag mit dem DLV, um eine noch gr&ouml;&szlig;ere Computer, der Z4 zu entwickeln. Diese Maschine hatte einen sehr &auml;hnlichen Aufbau wie die Z3, w&uuml;rde aber 1024 Speicher Worten statt von nur 64 haben. Die Maschine wurde gebaut und war fast fertig in 1945, als Berlin von russischen Truppen besetzt wurde. Zuse flog mit dem Z4 nach S&uuml;d-Deutschland, wo er sp&auml;ter bestellt wurde, um zu bleiben stationiert. Einige britische und amerikanische Milit&auml;r befragten Experten Zuse und inspiziert die Maschine nach dem Krieg, aber er war nicht unter den Wissenschaftlern, die ihre Karriere arbeiten f&uuml;r die Alliierten beendet.</p>
			<p>Nach dem Krieg setzte Zuse arbeitet haupts&auml;chlich auf zwei Projekte: a) die Entwicklung eines algorithmischen Sprache, die er als das Plankalk&uuml;l (Kalk&uuml;l der Programme), und b) Gr&uuml;ndung seines Unternehmens wieder. Der Plankalk&uuml;l kann als das erste High-Level-Programmiersprache, die zum Zeitpunkt konzipiert sein werden, obwohl kein Compiler oder Interpreter wurde jemals f&uuml;r sie geschrieben. Zuses Unternehmen nach Prof. Stiefel wiederbelebt wurde, von der Technischen Universit&auml;t von Z&uuml;rich, sah die refurbished Z4 in Betrieb und beschloss, ihn f&uuml;r seine Universit&auml;t zu mieten. Der Z4 in Z&uuml;rich wurde 1950 installiert und war der erste kommerzielle Computer in Betrieb ist, wurde einige Monate vor dem ersten UNIVAC in die USA geliefert.</p>
			<p>Zuses Unternehmen (mit dem neuen Namen Zuse KG) bl&uuml;hte nach dem Krieg und viele andere Maschinen wurden gebaut. Sie alle wurden nach und nach ihrer Einf&uuml;hrung nummeriert, dh gebracht, Z5, Z11, Z22, Z23, etc. Die Dominanz der amerikanischen Computer-Industrie in Europa, sowie die sp&auml;te Verabschiedung eines vollelektronischen Design die Zuse KG in finanzielle Schwierigkeiten. Das Unternehmen wurde 1962 von Brown, Boveri & Cie verkauft, und sp&auml;ter an Siemens. Die Produktion des Zuse-Serie von Computern wurde schlie&szlig;lich gestoppt.</p>
			<p>Im R&uuml;ckblick l&auml;sst sich sagen, dass Konrad Zuse die gr&ouml;&szlig;te Errungenschaft der Entwicklung einer Familie von voll digital, Floating-Point, programmierbare Maschinen, die in fast v&ouml;lliger Isolation intellektuellen 1936 bis 1945 gebaut wurden. Sein Traum war die Schaffung der kleinen Computer f&uuml;r gesch&auml;ftliche und wissenschaftliche Anwendungen. Er arbeitete zielstrebig w&auml;hrend vieler Jahre, um dieses Ziel zu erreichen. Besessen von seinen Maschinen, war Zuse meist ein unpolitischer Mensch und fortgesetzt wird, so nach dem Krieg. Seine Patentanmeldung von 1941 f&uuml;r die Rechenmaschine Z3 war definitiv nicht im Jahr 1967 von einem deutschen Richter gew&auml;hrt, der erkl&auml;rte, es mangels Erfindungsh&ouml;he. Allerdings Zuse sich immer als der wahre Erfinder des Computers und seine &ouml;ffentlichen Interventionen zu diesem Thema lassen immer etwas Bitterkeit schwitzen, bis zu seinem Tod im Jahr 1995.</p>
			<br />
			<p>Dieser Text wurde von <a href="http://translate.google.com/">Google Translator</a> &uuml;bersetzt.</p>
		</div>
		<br />						
		<div>
			<h2>Referenzen </h2>
			<ul>
				<li>Zuse, Konrad. The Computer - My Life. Berlin: Springer-Verlag, 1993.</li>							
				<li>Rojas, Ra&uacute;l. Konrad Zuse's Legacy: The Architecture of the Z1 and Z3. IEEE Annals of the History of Computing, 19:2, (1997), 5-16.</li>
			</ul>
		</div> 
	</body>
</html>